Repository: gdacosta-fr/RegExpWizard
Catalog: po/*.po
Languages: fr

source: Regular Expressions Wizard
fr: Assistant de constitution d'expressions rationnelles

source: Regular Expressions Wizard Gramplet assists you in building regular expressions, used for searching database records
fr: L'assistant de constitution d'expressions rationnelles vous aide à construire des expressions rationnelles, pour chercher des enregistrements de la base de données

source: Regular Expressions
fr: Expressions rationnelles

source: Matches
fr: Correspond

source: DOES NOT MATCH
fr: NE CORRESPOND PAS

source: or
fr: ou

source: Start of string
fr: Début de chaîne

source: End of string
fr: Fin de chaîne

source: INTERNAL ERROR the number of occurrences is missing
fr: ERREUR INTERNE le nombre d'occurrences n'est pas spécifié

source: INTERNAL ERROR max < min
fr: ERREUR INTERNE max < min

source: exactly
fr: exactement

source: Any number of occurrences
fr: Nombre quelconque d'occurrences

source: At least 1 occurrence
fr: Au moins 1 occurrence

source: INTERNAL ERROR the number of occurrences {n,m} is not taken into account
fr: ERREUR INTERNE le nombre d'occurrences {n,m} n'est pas pris en compte

source: of any character
fr: d'un caractère quelconque

source: of one character
fr: d'un caractère

source: among "
fr: parmi «

source: other than "
fr: autre que «

source: INTERNAL ERROR set "
fr: ERREUR INTERNE ensemble «

source: of "
fr: de «

source: " or "
fr: » ou «

source: Accept the element of the current regular expression, and add it after the regular expression being built.
fr: Accepter l'élément de l'expression rationnelle courant, et l'ajouter à la suite de l'expression rationnelle en cours de constitution.

source: Clear
fr: Effacer

source: Click to make a new regular expression
fr: Cliquer pour constituer une nouvelle expression rationnelle

source: Description, "in clear text", of the regular expression
fr: Description, « en clair », de l'expression rationnelle

source: Regular Expression:
fr: Expression rationnelle :

source: Result corresponding to the created regular expression. Manually copy and paste this result in Gramps fields accepting this type of expressions, or, better, click on the "Paste" button. Do not forget to check the "Use regular expressions" box.
fr: Résultat correspondant à l'expression rationnelle constituée. A copier et à coller dans les champs de Gramps acceptant ce type d'expressions, ou mieux, cliquer sur le bouton « Coller » Ne pas oublier de cocher la case « Utiliser les expressions rationnelles ».

source: The following description is found at the beginning of the string. In the general case, the regexp is searched anywhere in the string. By example by searching for "Start of string" + string "Louis" this allows to find "Louis", "Louis Marie",... but to ignore "Jean-Louis".
fr: La suite de la description correspond est à trouver en début de chaîne. Dans le cas général, l'expression rationnelle est cherchée n'importe où dans la chaîne. Par exemple en cherchant "Début de chaîne" + chaîne "Louis" cela permet de trouver "Louis", "Louis Marie",... mais d'ignorer "Jean-Louis".

source: Number of occurrences
fr: Nombres d'occurrences

source: Zero or one
fr: Zéro ou une

source: The element is optional.
fr: L'élément est facultatif.

source: One, exactly
fr: Une, exactement

source: At least one
fr: Au moins une

source: The element is present at least once.
fr: L'élément est présent au moins une fois.

source: Any, including zero
fr: Quelconque, y compris zéro

source: The element is present any number of times, including none.
fr: L'élément est présent un nombre quelconque de fois, y compris aucune.

source: String of characters
fr: Chaîne de caractères

source: The string of characters entered is searched as is.
fr: La chaîne de caractères saisie est cherchée telle quelle.

source: Text to search
fr: Texte à rechercher

source: Or
fr: Ou

source: You can specify multiple channel options to search.
fr: Vous pouvez spécifier plusieurs possibilités de chaînes à rechercher.

source: One character
fr: Un caractère

source: ordinary
fr: quelconque

source: Any character: alphabetic, including diacritical characters, numeric, punctuation, space,...
fr: Un caractère quelconque : alphabétique, y compris parmi les caractères diacritiques, numérique, ponctuation, espace,...

source: among
fr: parmi

source: List the characters, without any spaces nor commas. E.g.: eéêèë
fr: Lister les caractères, sans espaces ni virgules. Ex: eéêèë

source: except
fr: sauf

source: Any character, EXCEPT those mentioned here
fr: Un caractère quelconque, SAUF ceux spécifiés ici

source: in a set
fr: dans un ensemble

source: of
fr: de

source: The expression must be at the end of the string. In the general case, the expression is searched anywhere in the string.
fr: L'expression est à trouver en fin de chaîne. Dans le cas général, l'expression rationnelle est cherchée n'importe où dans la chaîne.

source: Regular Expression building
fr: Constitution de l'expression rationnelle

source: Case sensitive.
fr: Respect de la casse.

source: Strictly respect lowercase and uppercase characters. Generally, Gramps does not distinguish them.
fr: Respecter strictement les majuscules/minuscules. En général, Gramps ne fait pas la distinction.

source: String of characters, to be compared with RegExp for validation.
fr: Chaîne de caractères à confronter à l'expression rationnelle, pour la valider.

source: RegExp test zone
fr: Zone d'essai de l'expression rationnelle

source: Paste
fr: Coller

source: Paste the regular expression in the "Filter" tab, and select this tab.
fr: Coller l'expression rationnelle dans l'onglet « Filtre », et sélectionner cet onglet.
